; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.7.0
; Author:	Ahmad Alani <Ahmadalani75@hotmail.com>
; Homepage:	https://www.facebook.com/Ahmadalani75
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
1=ملف
2=خيارات
3=تعليمات
4=الأختيار الأول كأرشيف SF&X
; ------------------------------------
5=تحديد ملف
6=الإ&رشيف/المثبت للإستخراج:
7=تحديد مجلد
8=&مجلد الأستخراج:
9=في هذا التبويب، يمكنك سحب وإسقاط ملف
; ------------------------------------
10=خيارات %s
11=تتبع م&حفوظات الإرشيف
12=&إخفاء إطار وحدة التحكم
13=تقدم التحدي&ثات:
14=ال&لغة:
15=ت&ذكر وتأمين حجم الإطار
16=ع&دم إغلاق النافذة بعد الإستخراج
; ------------------------------------
17=خيارات التشكيل - تعيين
18=تحذ&ير قبل تنفيذ الملفات
19=إ&زالة الملفات المتكررة
20=إزالة الملفات ال&ؤقتة
21=إلحاق الإمتد&ادات المفقودة للملفات
22=حذف الملف بعد نجاح الإ&ستخراج
; ------------------------------------
23=حول البرنامج
; ------------------------------------
24=موقع %s
25=موقع النسخة الرسمي
26=منتدى النسخة المعدلة
; ------------------------------------
27=التحديث
28=التحقق الأخير للتحديث كان قبل أكثر من %s أيام
29=التحقق من التحديثات ألآن ؟
30=
; ------------------------------------
31=&أستخراج
32=ح&فظ
33=&تحديث
34=إل&غاء
35=إعدادات
; ------------------------------------
36=إستخراج %s
37=يدعم الطرق التالية لإستخراج حزم %s. %s %nولسوء الحظ، أيا من هذه الطرق ليست 100٪ موثوقة%nإذا لم تعمل الطريقة المحددة الرجاء إعادة تشغيل %s مرة أخرى وأختيار طريقة آخرى.
; ------------------------------------
38=طريقة الإستخراج
39= مثبت %s إداري
40=إستخراج %s
41=تبديل %s
42=فك حزمة %s
43=InstallShield ليس مثبت
44=إظهار المل&خص بعد الإستخراج
; ------------------------------------
; GUI control functions
45=تعطيل الأ&صوات في البرنامج
46=
47=الملف غير موجود:%n%s%n.الرجاء تحديد ملف صالح
48=فتح ملف
49=كتابة إلى
50=الكل
; Common terms
51=إرشيف
52=ملف مضغوط
53=
54=كتاب إنترنت
55=بطاقة إنترنت
56=ملف مشفر
57=تنفيذي مجهول
58=فشل التهيئة
59=ملف تعليمات
60=برنامج إصلاح
61=صورة
62=مثبت
63=دمج الوحدة النمطية
64=حزمة
65=رقعة
66=إستخراج-ذاتي
67=مرحلة
68=نجاح تهيئة
69=تجربة
70=أستخراج:
71=
72=تحديثات
73=
74=كل أسبوع|كل أسبوعين|كل شهر|أبدأ
; Status messages
75=فحص الملف للتعرف على نوعه
76=فحص الملف بواسطة فحص %s
77=إستخراج الملفات من:
78=إنتظار تهيئة المثبت%nالرجاء الإنتظار
79=
; Custom prompts
80=لا يمكن إستخراج تصوير %s مباشرة. بدلاً من ذلك سيتم%nبحيث يتم إستخراجه بعد ذلك ISO تحويل هذا التصوير إلى تصوبر%nهل تريد الإستمرار ؟%n%nملاحظة : هذه العملية تستغرق عدة دقائق
81=BIN/CUE إذا هذا تصوير CD-ROM خطأ : لا يمكن تحويل تصوير%nمهيأ بشكل صحيح CUE فتأكد من أن ملف
82=%s من تصوير ISO خطأ: تم إنشاء تصوير%nISO لكن لا يمكن تحويله. هل تريد إبقاء تصوير%nللمزيد من التحليل ؟
83=صالح MHT خطأ: هذا لا يظهر أن يكون ملف%nالكشف عن لا حدود
84=%s. الرجاء إغلاق المثبت، ثم أنقر 'حسناً' للإستمرار
85=ملاحظة: هذه الطريقة تعمل فقط مع حزم معينة لـ Wise for Windows Installer%n،وينتظر ببساطة للمدخلات Wise Installation إذا بدأ معالج هذا الملف غير معتمد%nسيحبط الإستخراج %s الرجاء إغلاق المثبت و%n%nهل ترغب في مواصلة الإستخراج ؟
86=.فقط %s أو إجراء فك %s يمكنك  مواصلة الإستخراج دون فك .%s تم حزم هذا الملف بضغط%n%n.%s أنقر 'نعم' للإستخراج دون فك%n%n.أنقر  .قط %s لا' لتشغيل فك'%n%nفي الحالة الأخيرة، سيتم تسمية الملف المفكك:%n%s
87=خطأ: %s%nتعذر التفكيك
88=تحذير: لإستخراج الملفات من هذا النوع يجب أن يتم ذلك مباشرة%nعند الإستمرار، سيتم تشغيل الأمر التالي :%n%n%s%n%nإذا كنت تعتقد أن هذا الملف قد يكون ضارا , فيستحسن عدم الإستمرار بالإستخراج%nهل تريد الإستمرار بالإستخراج ؟
89=تحذير: المجلد الوجهة %s موجود بالفعل!%nغير أستخراج مجلد فارغ يمكن أن يؤدي إلى وجود خطأ التفريغ.%n%nصقل المجلد قبل التفريغ ؟
90=مطلوب كلمة مرور لفك%n%n'%s'إلغاء تحديد %nلتمكين إدخال كلمة المرور.
91=
; Help text
92=إستخراج الملفات من أي نوع أرشيف أو حزمة تثبيت.%nالأستخدام:%n%s%n%nالأسباب المعتمدة:%n%s%t%tعرض معلومات التعليمات هذه%n%s%t%tفتح التبويب %s%n%s%tأسم الملف للإستخراج%n%s%tالدليل الذي يتم الإستخراج%n%nتجاوز %s بدلاً من وجهة أسم دليل الأرشاد%n%s للإستخراج إلى دليل فرعي مسمى بعد الأرشيف.%n%nمثال:%s%n%nتشغيل %s دون أي سبب ستظهر النافذة الرئيسية حيث يمكن للمستخدم تحديد الدليل الوجهة وأسم الملف.
93=
; Error messages
94=لا يمكن إستخراج %s في السجل.
95=بواسطة أرشيف 7-Zip
96=لا يمكن إستخراج %s%nأرجع نوع الملف: %s%n%nأنقر 'حسناً' إذا كنت تريد تحليل الملف بنفسك، أو 'إلغاء' للخروج
97=%s%nغير معروف و لا يمكن إستخراجه إمتداد
98=لا يمكن إنشاء المجلد:%n%s%n.الرجاء تحديد وجهة صالحة
99=.%s لا يمكن إستخراج%nمدعوم لكن الإستخراج فشل ،%s يبدو أن%nللمزيد من المعلومات %s الرجاء شاهد ملف السجل%n%nأنقر 'حسناً' لعرض ملف السجل الآن، أو 'إلغاء' للخروج
100=
; Update messages
101=التحديث أكتمل 
102=التحقق من التحديثات، الرجاء الأنتظار...
103=تحميل الملفات
104=أكتمال التحميل
105=تحديث للإصدار: %s
106=%nإعادة تشغيل %s!
107=إصدارك الحالي: %s%nالتحديث غير مطلوب
; ------------------------------------
108=فشل التحميل
109=تعذر تحميل قائمة الملفات من الخادم.%nقد قطع إتصال شبكة الإتصال%nأو خادم التحديث غير متوفر.
110=فشل في تحميل الملف
111=خطأ في ملف الأستخراج
112=أثناء التحديث إلى الإصدار: %s%nكان هناك خطأ، إعادة المحاولة!!!
113=أكتمل: %s من %s
114=
115=
116=
117=
118=
119=
